app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."completion_date" ASC, "tasks"."due_date" ASC
---
  def index
    @tasks = Task.all.order('completion_date DESC, due_date')

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    id = params[:id]
    @task = Task.find_by(id: id)

INSERT INTO "tasks" ("name", "description", "due_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "test"], ["description", "test"], ["due_date", "test"], ["created_at", "2018-09-21 20:42:00.956832"], ["updated_at", "2018-09-21 20:42:00.956832"]]
INSERT INTO "tasks" ("name", "description", "due_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "THIS IS A TEST TASK ADD!"], ["description", "HOPE IT WORKS!"], ["due_date", "2018-9-19"], ["created_at", "2018-09-19 22:33:24.239626"], ["updated_at", "2018-09-19 22:33:24.239626"]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tasks" SET "name" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["name", "Revisit Hotel project"], ["updated_at", "2018-09-22 02:54:22.801547"], ["id", 3]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "tasks" SET "due_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["due_date", "2018-07-12"], ["updated_at", "2018-09-21 19:53:09.386191"], ["id", 17]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 18]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", "2018-09-21"], ["updated_at", "2018-09-21 20:41:44.660853"], ["id", 2]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", nil], ["updated_at", "2018-09-21 20:41:43.545196"], ["id", 2]]
---
  def create
    @task = Task.new(task_params) #instantiate a new book
    if @task.save # save returns true if the database insert succeeds
      redirect_to root_path # go to the index so we can see the task in the list
    else # save failed :(
      render :new # show the new task form view again
    end
  end

  def new
    @task = Task.new
  end

  def edit
    id = params[:id]
    @task = Task.find_by(id: id)
  end

  def update
    id = params[:id]
    @task = Task.find_by(id: id)
    @task.update(task_params)
    if @task.save # save returns true if the database insert succeeds
      redirect_to task_path # go to the task detail page so we can see the updates
    else # save failed :(
      render :new # show the new task form view again
    end
  end

  def destroy
    id = params[:id]
    task = Task.find_by(id: id) # does not need @task because does not need a view
    if Task.delete(task)
      redirect_to root_path # go to the index so we can see the refreshed list
    else # delete failed :(
      render :not_found # show the new task form view again
    end
  end

  def complete
    id = params[:id]
    @task = Task.find_by(id: id)
    if @task.completion_date == nil
      @task.update(completion_date: Date.today.to_s)
    else
      @task.update(completion_date: nil)
    end
    redirect_to root_path # go to the task detail page so we can see the updates
  end

  private

    def task_params
      return params.require(:task).permit(:name, :description, :due_date, :completion_date)
    end
end