app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."name" = $1 LIMIT $2  [["name", "CS Fun 1"], ["LIMIT", 1]]
---
  def show
    name = params[:name]
    @task = Task.find_by(name: name)